{
  "layout": "blog",
  "title": "Announcing Carlita, the womenswear version of our Carlton coat.",
  "linktitle": "Announcing the Carlita Coat",
  "img": "sherlock.jpg",
  "caption": "Picture you and him, in matching coats.",
  "author": "Joost De Cock",
  "category": "core",
  "blurb": "Announcing the Carlita coat, the womenswear version of our Carlton coat pattern.",
  "meta": {
    "index": 4,
    "fileName": "2018-01-26-announcing-carlita.md",
    "section": "/blog",
    "dirName": "/"
  },
  "date": "2018-01-26",
  "path": "/blog/blog/announcing-carlita",
  "permalink": "/blog/announcing-carlita",
  "anchors": [],
  "body": "<p>This one’s for the ladies — and I’m not (just) talking about that picture of heart-throb Benedict Cumberbatch at the top of this post.</p>\n<p>Instead, I’m talking about the release of our latest pattern:\nthe <a href=\"/patterns/carlita\">Carlita Coat</a> which is out in beta as of today.</p>\n<p>Carlita is — you guessed it — the womenswear version of our Carlton coat, which recreates the iconic Sherlock\nHolmes coat worn by BC on the BBC series.</p>\n<h2>How did we do it?</h2>\n<p>For details on how this project came to be,\nI refer you to <a href=\"/blog/announcing-carlton-and-bent/\">the Carlton announcement post</a>.\nHere, I’d like to focus on the specifics of how we turned this menswear pattern into a coat for ladies.</p>\n<p>We wanted to stay as close to the original as possible, so all we did was make changes to address\none challenge: fitting the breasts.</p>\n<h3>Princess, meet your seam</h3>\n<p>We drew an extra princess seam in the front panel of the coat, through which we added shaping for the bust.</p>\n<p>To be able to do that accurately, Carlita requires three extra measurements in addition to the measurements required by Carlton. They are:</p>\n<ul>\n<li>The <a href=\"/docs/measurements/#highBust\">high bust</a></li>\n<li>The <a href=\"/docs/measurements/#bustSpan\">bust span</a></li>\n<li>The <a href=\"/docs/measurements/#highPointShoulderToBust\">high point shoulder to bust</a></li>\n</ul>\n<p>We use your high bust measurements to draft the coat, and then do a full bust adjustment on the\nprincess seam based on your (full) chest circumference, bust span and HPS to bust.</p>\n<h3>All of the pockets, but we had to move some of them</h3>\n<p>The addition of the princess seam made the map pocket placement a bit difficult,\nso we’ve slightly moved it, and aligned it vertically, rather than slightly tilted as it is in Carlton.</p>\n<p>This way, the pocket can be integrated in the princess seam, somewhere in the underboob region.</p>\n<h3>One extra option: The princess seam smooth factor</h3>\n<p>Carlita also has one extra option that Carlton doesn’t have, the somewhat elaborately named\n<a href=\"/docs/patterns/carlita/options#princessSeamSmoothFactor\">Princess seam smooth factor</a>.</p>\n<p>This controls how sharply the princess seam will revert back after having added the extra volume for your chest.</p>\n<p>A picture says more than a thousand words, so here’s the option sampled on the relevant part of the pattern:</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/announcing-carlita/smooth.png&quot;\ndescription=“The effect of the option as shown by our sampler service”\n%}</p>\n<p>As you can see, the option controls the urgency with which the princess seam reverts back to your waistline\nafter passing the fullest point of your bust.</p>\n<p>A low factor will make for a more fitted coat, but also a more curvy seam that is harder to sew.</p>\n<p>A higher smooth factor will smooth this out so it’s a more sloped retreat to the downward seam.\nThis will make the coat less fitted under your chest, and the seam easier to sew.</p>\n<h2>A reminder about made-to-measure patterns</h2>\n<p>This goes without saying for regular visitors to this site, but if you’re new here, it’s worth repeating:</p>\n<blockquote>\n<p>This coat is not drafted with a certain cup size in mind. Instead, it will adapt to your chest based on your measurements.\n{:.tip}</p>\n</blockquote>\n<h2>Ladies, we need your feedback</h2>\n<p>This is our first womenswear pattern with a fitted chest.\nAs such, we’re breaking new ground here, and I’d be interested to see how this pattern adapts to a variety of body shapes/cup sizes.</p>\n<p>If you’re planning to make this coat, or a muslin of it, please share your experience, and don’t hesitate to get in\ntouch should you run into any issues.</p>\n<p>I plan to design more womenswear patterns, so if there are any fit issues, I’d like to know about it sooner rather than later.</p>\n<h2>Shout-out</h2>\n<p>Last but not least, I’d like to thank <a href=\"http://www.annekecaramin.com/\">Anneke</a> for her help throughout this project, and tolerating my countless rants about\nmy love/hate relationship with boobs.</p>\n"
}