{
  "layout": "blog",
  "title": "Thanks for nothing Microsoft; Email shouldn't be this hard",
  "linktitle": "Thanks for nothing Microsoft",
  "img": "full.jpg",
  "caption": "Would you close a lane because one driver was playing their music too loud?",
  "author": "Joost De Cock",
  "category": "site",
  "blurb": "It's damn near impossible for people with a Hotmail/Outlook/MSN/Live email address to sign up for this website.",
  "meta": {
    "index": 18,
    "fileName": "2017-09-07-email-spam-problems.md",
    "section": "/blog",
    "dirName": "/"
  },
  "date": "2017-09-07",
  "path": "/blog/blog/email-spam-problems",
  "permalink": "/blog/email-spam-problems",
  "anchors": [],
  "body": "<p>People with an email address from Microsoft — think Hotmail, MSN, <a href=\"http://live.com\">live.com</a>, <a href=\"http://outlook.com\">outlook.com</a> and their numerous variants —\nare significantly less likely to sign up for this website.</p>\n<p>That’s because more than 4 times out of 10, they never receive their account activation email.</p>\n<h2>What’s going on?</h2>\n<p>Let’s first look at what’s happening. Here’s a relevant snippet from the logs:</p>\n<pre><code>Failed: postmaster@mg.freesewing.org -&gt; ********@hotmail.co.uk 'Confirm your freesewing account' \nServer response: 550 5.7.1 Unfortunately, messages from [104.130.122.15] weren't sent. \nPlease contact your Internet service provider since part of their network is on our block list. \n</code></pre>\n<p>What this means is that part of the MailGun network is on their block list.\nAs a result, they (more on who they are later) are not delivering any messages that go out.</p>\n<p><a href=\"https://www.mailgun.com/\">MailGun</a> is a popular email service for developers.\nIt’s used by this site to send out emails, like the account activation emails.</p>\n<p>Other people use this service too, and perhaps some of them, at some point,\ndelivered some spam messages through mailgun. Or it may just have been some guy with\na last name that tends to trigger spam filters.</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/email-spam-problems/mailgun.png&quot;\ndescription=“Some other MailGun customers. Not exactly a dodgy service is it?”\n%}\nPoint is, this IP address or one of its neighbours got <em>a bad rep</em>. It happens.\nBut to flat-out refuse to accept any messages from this host (or an entire network of hosts)\nis the equivalent of shutting down a highway lane (or entire highway)\nbecause one car in that lane played its music obnoxiously loud that one time.</p>\n<p>Which brings me to our next question:</p>\n<h2>Who would do something like that?</h2>\n<p>Good question. Here are some numbers:</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/email-spam-problems/emailgraph.png&quot;\ndescription=“A graph of mail delivery since the launch of this site”\n%}</p>\n<p>The graph above represents emails that were sent out since the launch of this site.\nThe small subsection of the graph that is red are emails that are dropped.</p>\n<p>This website sends out different kinds of email:</p>\n<ul>\n<li>The account confirmation email</li>\n<li>The <em>I forgot my password</em> emails</li>\n<li>Comment reply notifications</li>\n</ul>\n<p>The graph represents all email, but I’m focussing on the account confirmation emails only.\nThey are the most important after all.</p>\n<blockquote>\n<p>Apart from the 1 outlier, every message that was blocked, was blocked by Microsoft\n{:.quote}</p>\n</blockquote>\n<p>Here’s a list of all domains that blocked legitimate activation emails to their users:</p>\n<ul>\n<li><a href=\"http://btinternet.com\">btinternet.com</a></li>\n<li><a href=\"http://hotmail.com\">hotmail.com</a></li>\n<li><a href=\"http://hotmail.co.uk\">hotmail.co.uk</a></li>\n<li><a href=\"http://live.ca\">live.ca</a></li>\n<li><a href=\"http://live.com\">live.com</a></li>\n<li><a href=\"http://live.com.au\">live.com.au</a></li>\n<li><a href=\"http://live.nl\">live.nl</a></li>\n<li><a href=\"http://msn.com\">msn.com</a></li>\n<li><a href=\"http://outlook.com\">outlook.com</a></li>\n</ul>\n<p>Apart from that very first entry in the list (on which only 1 message was blocked) all of these are Microsoft domains.</p>\n<p>Let me restate that: Apart from the 1 outlier, every message that was blocked, was blocked by Microsoft.</p>\n<h2>What’s the impact?</h2>\n<p>So what sort of impact does that have on people?</p>\n<p>Well, at the time I’m writing this, there are 817 registered users, and about 80% (661) have also activated their account.</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/email-spam-problems/activations.svg&quot;\ndescription=“A disproportionate amount of pending activations is from users with an email address managed by Microsoft”\n%}</p>\n<p>From those people who were able to activate their account, less than 1% (6) have an email address managed by Microsoft.\nIn the group of people who did not, or were not able to, activate their account, more than half have such an address.</p>\n<p>More than 40% of account confirmation emails are simply blocked by Microsoft and, based on the number of activations,\nit seems likely that even when they aren’t block at the SMTP relay, they get filtered somewhere further down the line.</p>\n<p>As things stand, it seems almost impossible for the average hotmail/outlook/live/MSN/… user to sign up for this site.</p>\n<h2>What can we do about it?</h2>\n<p>I chose mailgun for a number of reasons. Not having to handle SMTP outselves simplifies the code.\nNot depending on a local SMTP deamon makes the code more portable, and MailGun has a bunch of cool features\nthat allow you to do things like replying to comments via email.</p>\n<p>Microsoft’s crude methods of spam filtering don’t invalidate any of those reasons.</p>\n<p>Using MailGun means using their SMTP relays, and being at the mercy of the reputation of that relay.\nThe only way around that is to configure a dedicated relay in MailGun so that <a href=\"http://freesewing.org\">freesewing.org</a> traffic is shielded from\nothers, and we become masters of our own reputation.</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/email-spam-problems/pricing.png&quot;\ndescription=&quot;$59 per month? Perhaps not&quot;\n%}</p>\n<p>For that priviledge, MailGun charges 59 dollar per month, which amounts to 708 dollar yearly.\nI invite you to take a look at <a href=\"/about/pledge#donations-history\">the donations history</a>,\nand you’ll understand that’s not going to happen either.</p>\n<p>I could challenge the block list, and try to get the relay unblocked.\nBut that’s pretty much tilting at windmills when the host is not under my control.\nNot to mention that MailGun doesn’t just have that one host.</p>\n<p>It seems that I’m running low on options and quiet frankly, I’m also running out of patience.</p>\n<h2>What I’m going to do about it</h2>\n<p>Microsoft is a behemoth, and I’m just a guy. I can’t fight them on this.\nUnless I Titanfall their ass.</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/email-spam-problems/titanfall.gif&quot;\ndescription=“Block this, bitch”\n%}</p>\n<p>Do you think Gmail is ever abused to send out spam? You know it is.\nDo you think they would ever block all email coming from Gmail? You know they won’t.</p>\n<p>So last night, I rolled out some changes to work around the issue.\nIf you have a <em>problemtic</em> email address, in addition to the regular email, this site will send out\na second email through Gmail.</p>\n<p>I’d like to see them block that.</p>\n<blockquote>\n<h5>Signup trouble? Help is available</h5>\n<p>If you are (still) having problems signing up, don’t hesitate to <a href=\"/contact\">get in touch</a>.\n{:.tip}</p>\n</blockquote>\n"
}