{
  "layout": "blog",
  "title": "The General Data Protection Regulation of the European Union: Our battle plan.",
  "linktitle": "Our battle plan for GDPR compliance",
  "img": "img.jpg",
  "caption": "This image is probably the only thing in the post you can skim diagonally",
  "author": "Joost De Cock",
  "category": "site",
  "blurb": "In 100 days, the General Data Protection Regulation of the European Union goes into force. Here's our plan.",
  "action": "blog/gdpr-plan",
  "meta": {
    "index": 2,
    "fileName": "2018-02-14-gdpr-plan.md",
    "section": "/blog",
    "dirName": "/"
  },
  "date": "2018-02-14",
  "path": "/blog/blog/gdpr-plan",
  "permalink": "/blog/gdpr-plan",
  "anchors": [
    [
      "#logtoc",
      "logtoc}"
    ]
  ],
  "body": "<p>This blog post is about the General Data Protection Regulation (GDPR) of the European Union (EU).\nWhile I cover the basics of GDPR, the main focus is on how it impacts <a href=\"http://freesewing.org\">freesewing.org</a>, and what we plan to do to in the 100 days that remain\nbefore GDPR goes into force.</p>\n<p>This is a bit of a long read, so here’s a table of contents:</p>\n<blockquote>\n<h5>Table of contents</h5>\n<p>{:.no_toc}</p>\n</blockquote>\n<ul>\n<li>TOC - Do not remove this line</li>\n</ul>\n<blockquote>\n<p>{:toc #blogtoc}</p>\n</blockquote>\n<h2>Thoughts on the EU’s GDPR</h2>\n<p>I have a love/hate relationship with the European Union.\nI love what they do and what they stand for, I hate how they do it.</p>\n<p>{%\ninclude floatimgonlarge.html url=&quot;/img/blog/gdpr-plan/rage-quit.gif&quot;\ndescription=“I totally get this dude”\n%}</p>\n<p>The GDPR is no different.\nIt’s an important piece of legislation that raises the bar for online privacy, which is great.\nBut as I was reading up on the subject, I felt the urge to rage-quit because OMG bureaucrats.</p>\n<p>Allow me to explain.</p>\n<h3>Privacy needs protection</h3>\n<p>For better or for worse (I believe for worse) the internet has settled into a modus operandi\nwhere you pay for <em>free stuff</em> with your personal data.\nSome people call it <a href=\"https://ar.al/notes/we-didnt-lose-control-it-was-stolen/\">people farming</a>, and I think that’s a great term.</p>\n<p>The <a href=\"https://www.nytimes.com/2017/05/10/technology/techs-frightful-five-theyve-got-us.html\">frightful five</a>\nare vacuuming up ever more of our personal lives.\nShort of never going online, there seems to be precious little we can do about it.</p>\n<h3>Why the EU is the best</h3>\n<p>This problem is too big to tackle by any of us.\nWho could possibly stand up to the combined power of the tech giants?</p>\n<p>Well, how’s this for a CV:</p>\n<ul>\n<li>Fined Facebook 110 million euro for misleading statements about their WhatsApp purchase</li>\n<li>Ordered Amazon to pay 250 million euro extra taxes in Luxembourg</li>\n<li>Fined Google 2.4 billion euro for abusing its dominant position in search</li>\n<li>Ordered Apple to pay 13 billion euro extra taxes in Ireland</li>\n</ul>\n<p>{%\ninclude floatimgonlarge.html url=&quot;/img/blog/gdpr-plan/titanfall.gif&quot;\ndescription=“We’re the EU, bitch”\n%}</p>\n<p>When it comes to tech giants, the European Union is all stick/ no carrot.</p>\n<p>The General Data Protection Regulation enforces privacy policies that respect users’ rights.\nIt applies to all EU citizens, all the time, everywhere.</p>\n<p>Doesn’t matter if you’re a silicon valley juggernaut, respect the rights of the EU citizens or face the wrath of the eurocracy:</p>\n<blockquote>\n<p>Organizations in breach of GDPR can be fined up to 4% of annual global turnover or 20 million euro (whichever is greater)\n{:.quote.full}</p>\n</blockquote>\n<p>Four percent of global turnover is <em>a very big stick</em>.</p>\n<h3>Why the EU is the worst</h3>\n<p>{%\ninclude floatimgonlarge.html url=&quot;/img/blog/gdpr-plan/complicated.gif&quot;\ndescription=“What I imagine a Article 29 Working Party looks like”\n%}\nThe EU being the EU, the regulation is a mixed bag of lofty goals and ideals, watered down by lobbying groups, and further complicated by the compromise required to get 28 member states on board.</p>\n<p>The intentions are great, it’s a great idea, but they are doing a terrible job at selling it — as usual.</p>\n<p>The practical implementation is in the hands of the so-called <em>Article 29 Working Party</em>\nwhich is currently keeping busy designing icons\n(I am <a href=\"https://www.google.be/search?q=standardised+icons+gdpr\">not making this up</a>)\nIt will change its name to the\n<em>European Data Protection Board</em> come May 25th, because you wouldn’t want to get too comfortable with all this jargon now, would you?</p>\n<h2>The GDPR in practice</h2>\n<p>If you’re looking for expert advice on GDPR compliance, this is not the place for you.</p>\n<p>But if you are curious about the GDPR and what it takes for a website like <a href=\"http://freesewing.org\">freesewing.org</a>\nto be compliant, read on.</p>\n<blockquote>\n<h5>Further reading</h5>\n<p>If you really want to know what GDPR is, the best thing you can do is\n<a href=\"http://eur-lex.europa.eu/legal-content/en/TXT/?uri=CELEX%3A32016R0679\">read the damn thing</a>. It ain’t no rocket science.</p>\n<p>If legislative texts make you run for the hills, the UKs ICO has\n<a href=\"https://ico.org.uk/for-organisations/guide-to-the-general-data-protection-regulation-gdpr/\">easily one of the best guides on GDPR</a>.\n{:.link}</p>\n</blockquote>\n<h3>Good to know</h3>\n<p>A few things you should know before we dive into GDPR:</p>\n<h4>There’s 100 days left</h4>\n<p>The GDPR was adopted back in 2016, but it won’t grow its teeth until May 25th 2018.</p>\n<p>Until that day, you get a pass. After that day, it’s for real.\nWhich means we have 100 days left to get our house in order.</p>\n<h4>There’s exemptions for SMEs</h4>\n<p>Organizations employing fewer than 250 people are exempt from some of the more bureaucratic aspects of the GDPR, such as a bunch of documenting requirements.</p>\n<p>Essentially, while you still have to do the right thing, there’s a lot less paperwork to fill out.</p>\n<p>Freesewing employs zero people, so we’re off the hook.</p>\n<h4>There’s extra provisions for sensitive data</h4>\n<blockquote>\n<p>Body measurements alone are not sensitive data\n{:.quote}</p>\n</blockquote>\n<p>The GDPR has extra provisions for <em>sensitive data</em>\nsuch as biometric data, profiling, and a bunch of other stuff.</p>\n<p>This was cause for concern because we collect body measurements, and one of our questions was whether that qualifies as biometric data.</p>\n<p>Turns out it doesn’t. Biometric data is what you can use to identify a person, like a fingerprint or iris scan. Body measurements alone are not sensitive data.</p>\n<h3>Collecting data through consent</h3>\n<p>To collect data, you need a so-called <em>lawful basis for data processing</em>.<br>\nThere are different types, but the one that applies to us (and to most online services) is <strong>consent</strong>.</p>\n<p>In this scenario, your legal basis for processing the data is that you’ve asked the person to get their data\nand they’ve freely given it to you.</p>\n<p>That is straight-forward, and makes sense. But the GDPR is really serious about making sure this consent is\nfreely given, and not wrestled from you grudgingly.</p>\n<p>To prevent companies from throwing up a big wall of legalese that people have to agree to, the GDPR outlines a number\nof principles this consent should adhere to. Here’s a non-exhaustive list:</p>\n<ul>\n<li>people should have real choice and control</li>\n<li>consent requires a positive opt-in, pre-ticked boxes or anything like that are not allowed</li>\n<li>there should be a very clear statement explaining what people are agreeing to</li>\n<li>these requests for consent must be separate from any terms &amp; conditions</li>\n<li>consent needs to be granular, you need individual consent for different things, and can’t ask for blanket consent</li>\n<li>it must be easy for people to redraw consent</li>\n<li>consent of data processing should not be a precondition for a service</li>\n</ul>\n<p>Looking at that list, I can’t help but feel that legislation would be a lot simpler if lawmakers could just write\n<em>don’t be a dick</em> and call it a day.</p>\n<h4>Consent granularity</h4>\n<p>Remember, we can’t just get blanket consent.\nWe need to get consent for every type of data processing we do.</p>\n<p>For <a href=\"http://freesewing.org\">freesewing.org</a>, we have identified three different types of data processing:</p>\n<ul>\n<li>Profile data</li>\n<li>Model data</li>\n<li>Patron data</li>\n</ul>\n<p>For each of these, we’ll need to get consent from the user, making sure it’s <em>real consent</em> as intended in the GDPR.</p>\n<p>Below is a mockup for what this could look like for each data type:</p>\n<p>{% include consent-profile.html %}\n{% include consent-model.html %}\n{% include consent-patron.html %}</p>\n<h4>Consent timing</h4>\n<p>The GDPR states that you should ask for consent when the data is collected.</p>\n<p>With our three types of data processing, that means that consent must be asked at different times:</p>\n<ul>\n<li><strong>Profile data</strong>: When signing up on the site</li>\n<li><strong>Model data</strong>: When creating the first model</li>\n<li><strong>Patron data</strong>: When becoming a patron</li>\n</ul>\n<p>This will (also) require some extra work to integrate this in the site.</p>\n<h3>Respecting basic rights when processing data</h3>\n<p>The EU enshrines basic rights for its citizens that should be respected when processing data.</p>\n<p>Let’s look at each of these rights and their impact on <a href=\"http://freesewing.org\">freesewing.org</a>.</p>\n<h4>The right to be informed</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to be informed</h5>\n<p>You need to be transparent about how you use personal data. Why you collect it, how you use it, and so on.</p>\n&quot;\nicon=&quot;info-circle&quot;\nicolor=’#00aeff’\n%}</p>\n<p>Informing users is something we are still working on. If anything, this blog post is part of that effort.</p>\n<p>We will need to design the individual privacy notices, but also a more overall privacy policy as well as\nmaking certain that users are informed of all their rights.</p>\n<p>While this will require some work, I don’t expect any problems here.</p>\n<h4>The right of access</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right of access</h5>\n<p>People have the right to know their data is processed, and to access that data.</p>\n&quot;\nicon=&quot;eye&quot;\nicolor=’#6f4c36’\n%}</p>\n<p>We are already compliant, as all data users enter on the site can also be accessed by them.</p>\n<h4>The right to rectification</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to rectification</h5>\n<p>People have the right to correct their data if it’s not correct.</p>\n&quot;\nicon=&quot;pencil&quot;\nicolor=’#c52a00’\n%}</p>\n<p>We are already compliant, as all data users enter on the site can also be edited by them.</p>\n<h4>The right to erasure</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to erasure</h5>\n<p>People have the right to have their data removed/erased.</p>\n&quot;\nicon=&quot;trash&quot;\nicolor=’#727272’\n%}</p>\n<p>We are already compliant, as users can remove their models, or entire account at any time.</p>\n<h4>The right to restrict processing</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to restrict processing</h5>\n<p>This right means that users must be able to put a <em>freeze</em> on all data processing, without going as far as to delete their data.</p>\n&quot;\nicon=&quot;pause-circle&quot;\nicolor=’#ffa239’\n%}</p>\n<p>We do not currently offer this possibility, and will need to add this functionality to the site.</p>\n<h4>The right to data portability</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to data portability</h5>\n<p>People not only have a right to export all their data, that export should also be in a format that makes it easy for them to take their data elsewhere.</p>\n&quot;\nicon=&quot;suitcase&quot;\nicolor=’#444’\n%}</p>\n<p>We are already compliant, as we allow users to export all of their data, and make it available in different standard formats (YAML and JSON).</p>\n<h4>The right to object</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>The right to object</h5>\n<p>The right to object applies specifically to:</p>\n<ul>\n<li>processing for public interests or by official authorities</li>\n<li>processing for direct marketing</li>\n<li>processing for science/historic research/statistics</li>\n</ul>\n<p>In these cases, people can object to this specific processing.</p>\n&quot;\nicon=&quot;hand-paper-o&quot;\nicolor=’#ad6224’\n%}</p>\n<p>This is going to apply to us when we start publishing anonymized model data, something that’s on our roadmap.</p>\n<p>The reason for publishing this data is that we want to make a dataset available of <em>real</em> body measurements, rather than the\n<em>standard</em> measurements that are typically used in the industry.</p>\n<p>This is something we’ll write about more at a later date, but essentially this falls under the <em>scientific research/statistics</em> category.\nAnd even though the data is anonimized, we still need to respect the right of users to object to this processing.</p>\n<p>As such, we should add the possibility to object to this specific use of the data.</p>\n<h4>Rights in relation to automated decision making and profiling</h4>\n<p>{% include blockquote.html\ncontent=&quot;<h5>Rights in relation to automated decision making and profiling</h5>\n<p>People have extra rights when it comes to profiling or decisions made by AI or algorithms without human involvement.</p>\n&quot;\nicon=&quot;cogs&quot;\nicolor=’#37874c’\n%}</p>\n<p>This is not relevant in our situation.</p>\n<h3>Privacy by design</h3>\n<p>The EU isn’t content with throwing up a couple of consent questions and respecting people’s rights when processing data.\nIt also wants to make certain that your privacy is (better) protected when things go wrong.</p>\n<p>That’s why it advocates for <em>privacy by design</em>. While it’s a concept that’s hard to pin down in legislation, the\npurpose is clear: They want everyone to consider privacy from the very start of their project/product/business, and\nnot as an afterthought.</p>\n<p>Things such as encryption (both in transit and for data at-rest), pseudonyms, and data expiry are suggested as\nthings to keep in mind while designing.</p>\n<p>Obviously, the EU is not going to come check your code to see whether you’ve taken privacy by design to heart.\nBut it can (and probably will) have an influence when things to wrong.</p>\n<p>Imagine two companies who have a data leak, one of them hasn’t done much to safeguard the privacy of their users,\nwhereas the other has taken <em>privacy by design</em> measures to mitigate the damage.</p>\n<p>It seems obvious that the EU is going to come down harder on the company who didn’t even try.</p>\n<h4>What we’re already doing</h4>\n<p>We already do a number of things that are driven by a <em>privacy by design</em> approach. For example:</p>\n<ul>\n<li>We use pseudonyms for user accounts</li>\n<li>We don’t share any data with any third party</li>\n<li>We don’t include any tracking code, or analytics</li>\n<li>We don’t use cookies</li>\n<li>We don’t have any social logins, like buttons, or other such things</li>\n<li>We don’t run/show any ads</li>\n<li>We don’t run any third-party JavaScript code</li>\n<li>We use encryption on all transport</li>\n</ul>\n<p>There’s some more info on this in this blog post:\n<a href=\"/blog/privacy-choices/\">The choices I’ve made to protect your privacy. Or why you won’t be getting any cookies</a>.</p>\n<p>These already form a very good basis for a privacy conscious website. But since we’ll need to make changes\nfor GDPR anyway, we’re considering other options to further raise the privacy bar.\nSpecifically, what can we do to limit the damage to our users in case there is a data leak.</p>\n<h4>Restriction of data storage</h4>\n<p>Some of the most sensitive data we store today is the address and birthday of our higher-tier patrons.</p>\n<p>However, the site does not need this information to function. We only need it for administrative purposes;\nSending out gifts and birthday cards to our patrons.</p>\n<p>As such, there’s no real need to keep this data in the freesewing database.\nWe could just as well write this information down in a notebook we keep on our coffee table.</p>\n<p>So, as part of our GDPR-related changes, we will remove this information from the database, and store it\noffline.</p>\n<h4>Encryption of data at rest</h4>\n<p>We already encrypt all data in transit. But, we are currently considering to add encryption of data at rest.</p>\n<p>The idea is to encrypt all data that could potentially identify a user.\nSuch as:</p>\n<ul>\n<li>Email address</li>\n<li>User name</li>\n<li>Model names</li>\n<li>Model notes</li>\n</ul>\n<p>This would add an extra layer of defense for our users’ privacy in case somehow our database gets dumped.</p>\n<p>While this change will be non-trivial to implement and come with a performance penalty, I feel it’s\nworth looking in to.</p>\n<h2>Conclusion</h2>\n<p>While we still have some work to do, we are already compliant with large parts of the GDPR, especially when\nit comes to respecting users rights:</p>\n<ul>\n<li>{:.ongoing} The right to be informed</li>\n<li>{:.done} The right of access</li>\n<li>{:.done} The right to rectification</li>\n<li>{:.done} The right to erasure</li>\n<li>{:.blocking} The right to restrict processing</li>\n<li>{:.done} The right to data portability</li>\n<li>{:.blocking} The right to object</li>\n<li>{:.done} Rights in relation to automated decision making and profiling\n{:.todo}</li>\n</ul>\n<p>We are currently working on <em>the right to be informed</em> and have a plan\nfor the changes required to respect <em>the right to restrict processing</em> and <em>the right to object</em>.</p>\n<p>On the data collection site, we need to hammer out the details for our privacy notices.\nWe’ll also write a detailed privacy policy that bundles all the info from the different notices.</p>\n<p>We’ll need to add changes to the user on-boarding to make sure notices are presented at the correct time.\nNot to mention that we’ll need to keep track of who gave their consent for what.</p>\n<h3>Action points</h3>\n<ul>\n<li>Draft privacy notices for profile/model/patron data</li>\n<li>Integrate consent in user on-boarding, model creation, and patron sign-up</li>\n<li>Make site functionality depend on consent</li>\n<li>Provide a centralized privacy dashboard where people can review their privacy settings/consent</li>\n<li>Add email notifications every time consent is changed</li>\n<li>Provide a way for people to <em>freeze</em> their account</li>\n<li>Provide a way for people to object to their model data being used for research and statistics</li>\n<li>Write and publish an overall privacy policy</li>\n<li>Encrypt sensitive data in the database\n{:.todo}</li>\n</ul>\n<p>Seems like we’ve got a lot of work ahead of us.</p>\n<h3>Feedback</h3>\n<p>It is my personal opinion that the GDPR is a good thing.\nBut I want to hear from you about the changes outlined in this blog post.</p>\n<p>So please reach out with your feedback and comments.\nIt is after all your data we’re talking about.</p>\n"
}