{
  "layout": "blog",
  "title": "The Benjamin Bow Tie pattern is now available in beta. And I didn't even have to do anything.",
  "linktitle": "The Benjamin Bow Tie is now available in beta",
  "img": "bowtie.jpg",
  "caption": "A collection of bow ties from Wouter, who designed and coded this pattern",
  "author": "Joost De Cock",
  "category": "core",
  "blurb": "Announcing the Benjamin Bow Tie, our first ever community pattern.",
  "meta": {
    "index": 12,
    "fileName": "2017-11-14-benjamin-bow-tie-beta.md",
    "section": "/blog",
    "dirName": "/"
  },
  "date": "2017-11-14",
  "path": "/blog/blog/benjamin-bow-tie-beta",
  "permalink": "/blog/benjamin-bow-tie-beta",
  "anchors": [],
  "body": "<p>Our family of freesewing patterns has grown once again, and the benjamin of the family is… <a href=\"/patterns/benjamin\">Benjamin</a>.</p>\n<p>Benjamin is a bow tie that comes with a variety of options to control pretty much every aspect of your bow tie.</p>\n<p>You can opt for a made-to-measure bow tie, or draft Benjamin with an adjustment ribbon to allow\nsome flexibility in the fit. Something that makes this a great handmade gift for the opcoming holiday season.</p>\n<h2>Benjamin is more special than you realize</h2>\n<p>Here’s the thing about Benjamin that I’m most excited about: I didn’t do anything.</p>\n<p>{% include figure.html\nurl=&quot;/img/blog/benjamin-bow-tie-beta/benjamins.jpg&quot;\ndescription=“A collection of bow ties from Wouter, who designed and coded this pattern”\n%}</p>\n<p>That’s right, Benjamin was designed and coded by\n<a href=\"/users/xdpug\">Wouter Van Wageningen</a> who has over the last couple of months\nbeen teaching himself the ins and outs of the freesewing platform:</p>\n<blockquote>\n<p>I had a blast making the Bow Tie pattern.\nI basically used it to move from the BabyBib tutorial into something that was\noriginal and not too complex (and actually useful).\nI wanted to get the whole process under control before venturing out into the real stuff.</p>\n<p>That I was able to pick things up so easily is due mostly to the great\n<a href=\"/docs/designer/tutorial/part-1\">BabyBib tutorial</a>\nand the help you’ve provided <a href=\"https://gitter.im/freesewing/freesewing\">here</a>.\n{:.quote.full}</p>\n</blockquote>\n<h2>Who will be next to contribute a pattern?</h2>\n<p>When I released freesewing as an open source platform, I obviously hoped that others would\njoin the effort.</p>\n<p>But I never thought that less than 3 months after the public release of freesewing,\nwe’d have our first pattern from the freesewing community.</p>\n<p>{% include figure.html url=&quot;/img/blog/benjamin-bow-tie-beta/giphy.gif&quot; description=“Benjamin is kind of a big deal” %}</p>\n<p>So yeah, Benjamin is a BFD, Wouter is a badass, and I am hopeful that this will be the first\nof many patterns that we as a community will be able to make available to all.</p>\n"
}